DROP TABLE if EXISTS players;
DROP TABLE if EXISTS race;
DROP TABLE if EXISTS profession;

CREATE TABLE race
(
    id  serial primary key,
    name varchar NOT NULL UNIQUE
);

INSERT INTO race(name)
values ('HUMAN'),
       ('DWARF'),
       ('ELF'),
       ('GIANT'),
       ('ORC'),
       ('TROLL'),
       ('HOBBIT');

CREATE TABLE profession
(
    id   serial primary key,
    name varchar NOT NULL UNIQUE
);

INSERT INTO profession(name)
values ('WARRIOR'),
       ('ROGUE'),
       ('SORCERER'),
       ('CLERIC'),
       ('PALADIN'),
       ('NAZGUL'),
       ('WARLOCK'),
       ('DRUID');

CREATE TABLE players
(
    id               serial PRIMARY KEY,
    name             varchar(12)                       NOT NULL,
    title            varchar(30)                       NOT NULL,
    race_id          int REFERENCES race (id)          NOT NULL,
    profession_id    int REFERENCES profession (id)    NOT NULL,
    experience       int CHECK (experience < 10000000) NOT NULL,
    level            int                               NOT NULL,
    until_next_level int                               NOT NULL,
    birthday         date                              NOT NULL,
    banned           boolean                           NOT NULL
);

INSERT INTO players(name, title, race_id, profession_id, birthday, banned, experience, level, until_next_level)
VALUES ('Ниус', 'Приходящий Без Шума', 7, 2, '2010-10-12', false, 58347, 33, 1153)
     , ('Никрашш', 'НайтВульф', 5, 7, '2010-02-14', false, 174403, 58, 2597)
     , ('Эззэссэль', 'шипящая', 2, 4, '2006-02-28', true, 804, 3, 196)
     , ('Бэлан', 'Тсе Раа', 2, 2, '2008-02-25', true, 44553, 29, 1947)
     , ('Элеонора', 'Бабушка', 1, 3, '2006-01-07', true, 63986, 35, 2614)
     , ('Эман', 'Ухастый Летун', 3, 3, '2004-06-21', false, 163743, 56, 1557)
     , ('Талан', 'Рожденный в Бронксе', 4, 2, '2005-05-15', false, 68950, 36, 1350)
     , ('Арилан', 'Благотворитель', 3, 3, '2006-08-10', false, 61023, 34, 1977)
     , ('Деракт', 'Эльфёнок Красное Ухо', 3, 2, '2010-06-22', false, 156630, 55, 2970)
     , ('Архилл', 'Смертоносный', 4, 5, '2005-01-12', false, 76010, 38, 1990)
     , ('Энда3рион', 'Маленький эльфенок', 3, 8, '2001-04-24', false, 103734, 45, 4366)
     , ('Фаэрвин', 'Темный Идеолог', 1, 6, '2010-09-06', false, 7903, 12, 1197)
     , ('Харидин', 'Бедуин', 6, 7, '2009-09-08', false, 114088, 47, 3512)
     , ('Джур', 'БоРец с жАжДой', 5, 8, '2009-07-14', false, 29573, 23, 427)
     , ('Грон', 'Воин обреченный на бой', 4, 5, '2005-04-28', false, 174414, 58, 2586)
     , ('Морвиел', 'Копье Калимы', 3, 4, '2010-03-15', false, 49872, 31, 2928)
     , ('Ннуфис', 'ДиамантоваЯ', 1, 2, '2001-09-03', false, 162477, 56, 2823)
     , ('Ырх', 'Троль гнет ель', 6, 7, '2001-04-08', true, 136860, 51, 940)
     , ('Блэйк', 'Серый Воин', 1, 2, '2005-05-23', false, 151039, 54, 2961)
     , ('Нэсс', 'Бусинка', 6, 7, '2008-02-09', true, 64945, 35, 1655)
     , ('Ферин', 'Воитель', 6, 7, '2003-07-08', false, 120006, 48, 2494)
     , ('Солках', 'Ученик Магии', 3, 3, '2001-11-07', false, 152996, 54, 1004)
     , ('Сцинк', 'Титан Войны', 4, 7, '2008-01-04', true, 86585, 41, 3715)
     , ('Айша', 'Искусительница', 1, 4, '2010-01-25', false, 106181, 45, 1919)
     , ('Тант', 'Черт закAтай вату', 2, 5, '2010-10-03', false, 33889, 25, 1211)
     , ('Трениган', 'Великий Волшебник', 3, 3, '2004-05-17', false, 91676, 42, 2924)
     , ('Вуджер', 'Печальный', 6, 6, '2010-10-04', false, 93079, 42, 1521)
     , ('Камираж', 'БAнкир', 2, 4, '2005-08-05', true, 79884, 39, 2116)
     , ('Ларкин', 'СвЯтой', 7, 4, '2003-07-10', false, 111868, 46, 932)
     , ('Зандир', 'Темновидец', 3, 7, '2003-05-24', false, 29654, 23, 346)
     , ('Балгор', 'пещерный Урук', 5, 6, '2005-02-23', false, 18869, 18, 131)
     , ('Регарн', 'Любитель ОЛивье', 4, 7, '2006-12-23', false, 144878, 53, 3622)
     , ('Анжелли', 'Молодой Боец', 2, 7, '2010-04-08', false, 59281, 33, 219)
     , ('Джерис', 'Имперский Воин', 5, 7, '2001-05-12', false, 173807, 58, 3193)
     , ('Жэкс', 'Ярочкино Солнышко', 4, 7, '2008-01-04', false, 848, 3, 152)
     , ('Филуэль', 'Химик и Карпускулярник.', 3, 7, '2008-08-03', false, 48496, 30, 1104)
     , ('Яра', 'Прельстивая', 1, 4, '2004-06-12', false, 138306, 52, 4794)
     , ('Иллинас', 'Иероглиф', 7, 7, '2007-06-03', false, 115546, 47, 2054)
     , ('Ардонг', 'Вспышк A', 1, 7, '2009-09-16', false, 24984, 21, 316)
     , ('Аттирис', 'и.о.Карвандоса', 3, 3, '2010-04-15', true, 60520, 34, 2480);